# GetTexSpace2DRot

## Description
Function GetTexSpace2DRot returns the rotation of the referenced texture space (in degrees).

```pascal
FUNCTION GetTexSpace2DRot(textureSpace : HANDLE) : REAL;
```

```python

def vs.GetTexSpace2DRot(textureSpace):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureSpace|HANDLE|Handle to texture space.|

## Remarks
Returns rotation in degrees

## Version
```diff
- GetTexSpace2DRot is obsolete as of Vectorworks 2009
```

Availability: from VectorWorks8.0
## Category
* Textures